app/controllers/games_controller.rb

    def update
        @game = Game.find(params[:id])
        @game.update(board_state: params[:board_state])
        @game.update(score: params[:score])
        @game.update(game_over: params[:game_over])
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "games" SET "board_state" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["board_state", "[[\"5\",\"0\",\"0\",\"0\"],[\"9\",\"7\",\"0\",\"0\"],[\"3\",\"3\",\"0\",\"0\"],[\"6\",\"0\",\"0\",\"0\"]]"], ["updated_at", "2021-03-08 20:12:19.933132"], ["id", 2]]
UPDATE "games" SET "board_state" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["board_state", "[[\"20\",\"5\",\"80\",\"5\"],[\"0\",\"20\",\"24\",\"20\"],[\"5\",\"12\",\"80\",\"40\"],[\"0\",\"0\",\"40\",\"10\"]]"], ["updated_at", "2021-03-09 17:49:38.382632"], ["id", 2]]
UPDATE "games" SET "game_over" = $1, "updated_at" = $2 WHERE "games"."id" = $3  [["game_over", true], ["updated_at", "2021-03-08 21:48:08.849469"], ["id", 2]]