app/controllers/users_controller.rb

    def create
        @user = User.create(user_params)
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "george"], ["created_at", "2021-03-09 19:04:43.447177"], ["updated_at", "2021-03-09 19:04:43.447177"]]

    def nextgame
        @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]