app/models/user.rb

    def next_game(name_of_the_game)     # this method finds an existing open game (of the given type), or creates a new one if none exist
        open_game = self.games.find{|game| game.name == name_of_the_game && !game.game_over}
        open_game ? open_game : Game.create(user: self, name: name_of_the_game)
---
SELECT "games".* FROM "games" WHERE "games"."user_id" = $1  [["user_id", 1]]
INSERT INTO "games" ("user_id", "score", "board_state", "game_over", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"